Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1021/src/sdmmc_init.h
#if BL_FEATURE_SD_MODULE
/*! @brief SD power control function. */
#define BOARD_USDHC_SDCARD_POWER_CONTROL_INIT()                                          \
    {                                                                                    \
        IOMUXC_SetPinMux(BOARD_SD_RESET_B_GPIO_IOMUXC, false);                           \
        gpio_pin_config_t sw_config = {                                                  \
            kGPIO_DigitalOutput, 0, kGPIO_NoIntmode,                                     \
        };                                                                               \
        GPIO_PinInit(BOARD_SD_RESET_B_GPIO_BASE, BOARD_SD_RESET_B_GPIO_PIN, &sw_config); \
    }
#define BOARD_USDHC_SDCARD_POWER_CONTROL(state) \
    (GPIO_WritePinOutput(BOARD_SD_RESET_B_GPIO_BASE, BOARD_SD_RESET_B_GPIO_PIN, state))

/*! @brief SD vselect function. */
#define BOARD_USDHC_SDCARD_VSELECT_INIT()                                                                              \
    {                                                                                                                  \
        IOMUXC_SetPinMux(BOARD_SD_VSELECT_IOMUXC, false);                                                              \
        IOMUXC_SetPinConfig(BOARD_SD_VSELECT_IOMUXC, IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK | \
                                                         IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |                              \
                                                         IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |                              \
                                                         IOMUXC_SW_PAD_CTL_PAD_SPEED(2) |                              \
                                                         IOMUXC_SW_PAD_CTL_PAD_PUS(1) | IOMUXC_SW_PAD_CTL_PAD_DSE(1)); \
    }

#define BOARD_SD_MUX_CONFIG(base, busWidth)                                                               \
    {                                                                                                     \
        switch (busWidth)                                                                                 \
        {                                                                                                 \
            case kSD_DataBusWidth4Bit:                                                                    \
                IOMUXC_SetPinMux(BOARD_SD_DATA1_IOMUXC, false);                                           \
                IOMUXC_SetPinMux(BOARD_SD_DATA2_IOMUXC, false);                                           \
                IOMUXC_SetPinMux(BOARD_SD_DATA3_IOMUXC, false);                                           \
                IOMUXC_SetPinConfig(BOARD_SD_DATA1_IOMUXC,                                                \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_SD_DATA2_IOMUXC,                                                \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_SD_DATA3_IOMUXC,                                                \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
            case kSD_DataBusWidth1Bit:                                                                    \
                IOMUXC_SetPinMux(BOARD_SD_CMD_IOMUXC, true);                                              \
                IOMUXC_SetPinMux(BOARD_SD_CLK_IOMUXC, false);                                             \
                IOMUXC_SetPinMux(BOARD_SD_DATA0_IOMUXC, false);                                           \
                IOMUXC_SetPinConfig(BOARD_SD_CMD_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_SD_CLK_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_SD_DATA0_IOMUXC,                                                \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
        }                                                                                                 \
    }

#define BOARD_SD_PIN_CONFIG(speed, strength)

