Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1021/src/sdmmc_init.h
/* define for SD config IO driver strength dynamic */
#define BOARD_SD_IO_UPDATE(base, busWidth, speed, strength)                                                 \
    {                                                                                                       \
        switch (busWidth)                                                                                   \
        {                                                                                                   \
            case kSD_DataBusWidth4Bit:                                                                      \
                IOMUXC_SetPinConfig(BOARD_SD_DATA1_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_SD_DATA2_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_SD_DATA3_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
            case kSD_DataBusWidth1Bit:                                                                      \
                IOMUXC_SetPinConfig(BOARD_SD_CMD_IOMUXC,                                                    \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_SD_CLK_IOMUXC,                                                    \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_SD_DATA0_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
        }                                                                                                   \
    }
#else
#define BOARD_USDHC_SDCARD_POWER_CONTROL_INIT()
#define BOARD_USDHC_SDCARD_POWER_CONTROL(state)
#define BOARD_USDHC_SDCARD_VSELECT_INIT()
#define BOARD_SD_MUX_CONFIG(base, busWidth)
#define BOARD_SD_PIN_CONFIG(speed, strength)
#define BOARD_SD_IO_UPDATE(base, busWidth, speed, strength)
#endif

#if BL_FEATURE_MMC_MODULE
/*! @brief MMC power control function. */
#define BOARD_USDHC_MMCCARD_POWER_CONTROL_INIT()                                            \
    {                                                                                       \
        IOMUXC_SetPinMux(BOARD_MMC_RESET_B_GPIO_IOMUXC, false);                             \
        gpio_pin_config_t sw_config = {                                                     \
            kGPIO_DigitalOutput, 0, kGPIO_NoIntmode,                                        \
        };                                                                                  \
        GPIO_PinInit(BOARD_MMC_RESET_B_GPIO_BASE, BOARD_MMC_RESET_B_GPIO_PIN, &sw_config);  \
        GPIO_WritePinOutput(BOARD_MMC_RESET_B_GPIO_BASE, BOARD_MMC_RESET_B_GPIO_PIN, true); \
    }
#define BOARD_USDHC_MMCCARD_POWER_CONTROL(state) \
    (GPIO_WritePinOutput(BOARD_MMC_RESET_B_GPIO_BASE, BOARD_MMC_RESET_B_GPIO_PIN, state))

/*! @brief MMC vselect function. */
#ifdef BOARD_MMC_VSELECT_IOMUXC
#define BOARD_USDHC_MMCCARD_VSELECT_INIT()                                                        \
    {                                                                                             \
        IOMUXC_SetPinMux(BOARD_MMC_VSELECT_IOMUXC, false);                                        \
        IOMUXC_SetPinConfig(BOARD_MMC_VSELECT_IOMUXC,                                             \
                            IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
    }
#else
#define BOARD_USDHC_MMCCARD_VSELECT_INIT() \
    do                                     \
    {                                      \
    } while (0)
#endif // BOARD_USDHC_MMCCARD_VSELECT_INIT

#define BOARD_MMC_MUX_CONFIG(base, busWidth)                                                              \
    {                                                                                                     \
        switch (busWidth)                                                                                 \
        {                                                                                                 \
            case kMMC_DataBusWidth8bitDDR:                                                                \
            case kMMC_DataBusWidth8bit:                                                                   \
                IOMUXC_SetPinMux(BOARD_MMC_DATA4_IOMUXC, false);                                          \
                IOMUXC_SetPinMux(BOARD_MMC_DATA5_IOMUXC, false);                                          \
                IOMUXC_SetPinMux(BOARD_MMC_DATA6_IOMUXC, false);                                          \
                IOMUXC_SetPinMux(BOARD_MMC_DATA7_IOMUXC, false);                                          \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA4_IOMUXC,                                               \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA5_IOMUXC,                                               \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA6_IOMUXC,                                               \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA7_IOMUXC,                                               \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
            case kMMC_DataBusWidth4bitDDR:                                                                \
            case kMMC_DataBusWidth4bit:                                                                   \
                IOMUXC_SetPinMux(BOARD_MMC_DATA1_IOMUXC, false);                                          \
                IOMUXC_SetPinMux(BOARD_MMC_DATA2_IOMUXC, false);                                          \
                IOMUXC_SetPinMux(BOARD_MMC_DATA3_IOMUXC, false);                                          \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA1_IOMUXC,                                               \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA2_IOMUXC,                                               \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA3_IOMUXC,                                               \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
            case kMMC_DataBusWidth1bit:                                                                   \
            default:                                                                                      \
                IOMUXC_SetPinMux(BOARD_MMC_CMD_IOMUXC, true);                                             \
                IOMUXC_SetPinMux(BOARD_MMC_CLK_IOMUXC, false);                                            \
                IOMUXC_SetPinMux(BOARD_MMC_DATA0_IOMUXC, false);                                          \
                IOMUXC_SetPinConfig(BOARD_MMC_CMD_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_MMC_CLK_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(4));                                    \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA0_IOMUXC,                                               \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
        }                                                                                                 \
    }

